// Задача 2: Напишите программу, которая принимает на вход координаты точки (X и Y), 
// причём X ≠ 0 и Y ≠ 0 и выдаёт номер координатной четверти плоскости, в которой находится эта точка.


Console.Write("Введите координату х: ");
int x = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите координату у: ");
int y = Convert.ToInt32(Console.ReadLine());


