//  Задача 4: Напишите программу, которая на вход принимает натуральное число N,
//  а на выходе показывает его цифры через запятую.




// int number = Convert.ToInt32(Console.ReadLine());

// while (number > 0)













Console.Write(3 / 10);
